RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/psram_reg.h
/* 0x4 : psram_manual_control */
#define PSRAM_MANUAL_CONTROL_OFFSET    (0x4)
#define PSRAM_REG_WC_SW                PSRAM_REG_WC_SW
#define PSRAM_REG_WC_SW_POS            (0U)
#define PSRAM_REG_WC_SW_LEN            (7U)
#define PSRAM_REG_WC_SW_MSK            (((1U << PSRAM_REG_WC_SW_LEN) - 1) << PSRAM_REG_WC_SW_POS)
#define PSRAM_REG_WC_SW_UMSK           (~(((1U << PSRAM_REG_WC_SW_LEN) - 1) << PSRAM_REG_WC_SW_POS))
#define PSRAM_REG_WC_SW_EN             PSRAM_REG_WC_SW_EN
#define PSRAM_REG_WC_SW_EN_POS         (8U)
#define PSRAM_REG_WC_SW_EN_LEN         (1U)
#define PSRAM_REG_WC_SW_EN_MSK         (((1U << PSRAM_REG_WC_SW_EN_LEN) - 1) << PSRAM_REG_WC_SW_EN_POS)
#define PSRAM_REG_WC_SW_EN_UMSK        (~(((1U << PSRAM_REG_WC_SW_EN_LEN) - 1) << PSRAM_REG_WC_SW_EN_POS))
#define PSRAM_REG_STATE_HOLD_TICK      PSRAM_REG_STATE_HOLD_TICK
#define PSRAM_REG_STATE_HOLD_TICK_POS  (9U)
#define PSRAM_REG_STATE_HOLD_TICK_LEN  (1U)
#define PSRAM_REG_STATE_HOLD_TICK_MSK  (((1U << PSRAM_REG_STATE_HOLD_TICK_LEN) - 1) << PSRAM_REG_STATE_HOLD_TICK_POS)
#define PSRAM_REG_STATE_HOLD_TICK_UMSK (~(((1U << PSRAM_REG_STATE_HOLD_TICK_LEN) - 1) << PSRAM_REG_STATE_HOLD_TICK_POS))
#define PSRAM_REG_DQS_LATCH_INV        PSRAM_REG_DQS_LATCH_INV
#define PSRAM_REG_DQS_LATCH_INV_POS    (10U)
#define PSRAM_REG_DQS_LATCH_INV_LEN    (1U)
#define PSRAM_REG_DQS_LATCH_INV_MSK    (((1U << PSRAM_REG_DQS_LATCH_INV_LEN) - 1) << PSRAM_REG_DQS_LATCH_INV_POS)
#define PSRAM_REG_DQS_LATCH_INV_UMSK   (~(((1U << PSRAM_REG_DQS_LATCH_INV_LEN) - 1) << PSRAM_REG_DQS_LATCH_INV_POS))
#define PSRAM_REG_WB_BL2_MASK          PSRAM_REG_WB_BL2_MASK
#define PSRAM_REG_WB_BL2_MASK_POS      (11U)
#define PSRAM_REG_WB_BL2_MASK_LEN      (1U)
#define PSRAM_REG_WB_BL2_MASK_MSK      (((1U << PSRAM_REG_WB_BL2_MASK_LEN) - 1) << PSRAM_REG_WB_BL2_MASK_POS)
#define PSRAM_REG_WB_BL2_MASK_UMSK     (~(((1U << PSRAM_REG_WB_BL2_MASK_LEN) - 1) << PSRAM_REG_WB_BL2_MASK_POS))
#define PSRAM_REG_FORCE_CEB_LOW        PSRAM_REG_FORCE_CEB_LOW
#define PSRAM_REG_FORCE_CEB_LOW_POS    (12U)
#define PSRAM_REG_FORCE_CEB_LOW_LEN    (1U)
#define PSRAM_REG_FORCE_CEB_LOW_MSK    (((1U << PSRAM_REG_FORCE_CEB_LOW_LEN) - 1) << PSRAM_REG_FORCE_CEB_LOW_POS)
#define PSRAM_REG_FORCE_CEB_LOW_UMSK   (~(((1U << PSRAM_REG_FORCE_CEB_LOW_LEN) - 1) << PSRAM_REG_FORCE_CEB_LOW_POS))
#define PSRAM_REG_FORCE_CEB_HIGH       PSRAM_REG_FORCE_CEB_HIGH
#define PSRAM_REG_FORCE_CEB_HIGH_POS   (13U)
#define PSRAM_REG_FORCE_CEB_HIGH_LEN   (1U)
#define PSRAM_REG_FORCE_CEB_HIGH_MSK   (((1U << PSRAM_REG_FORCE_CEB_HIGH_LEN) - 1) << PSRAM_REG_FORCE_CEB_HIGH_POS)
#define PSRAM_REG_FORCE_CEB_HIGH_UMSK  (~(((1U << PSRAM_REG_FORCE_CEB_HIGH_LEN) - 1) << PSRAM_REG_FORCE_CEB_HIGH_POS))
#define PSRAM_REG_PSRAM_RESETB         PSRAM_REG_PSRAM_RESETB
#define PSRAM_REG_PSRAM_RESETB_POS     (14U)
#define PSRAM_REG_PSRAM_RESETB_LEN     (1U)
#define PSRAM_REG_PSRAM_RESETB_MSK     (((1U << PSRAM_REG_PSRAM_RESETB_LEN) - 1) << PSRAM_REG_PSRAM_RESETB_POS)
#define PSRAM_REG_PSRAM_RESETB_UMSK    (~(((1U << PSRAM_REG_PSRAM_RESETB_LEN) - 1) << PSRAM_REG_PSRAM_RESETB_POS))
#define PSRAM_REG_CK_EDGE_NALI         PSRAM_REG_CK_EDGE_NALI
#define PSRAM_REG_CK_EDGE_NALI_POS     (15U)
#define PSRAM_REG_CK_EDGE_NALI_LEN     (1U)
#define PSRAM_REG_CK_EDGE_NALI_MSK     (((1U << PSRAM_REG_CK_EDGE_NALI_LEN) - 1) << PSRAM_REG_CK_EDGE_NALI_POS)
#define PSRAM_REG_CK_EDGE_NALI_UMSK    (~(((1U << PSRAM_REG_CK_EDGE_NALI_LEN) - 1) << PSRAM_REG_CK_EDGE_NALI_POS))
#define PSRAM_STS_CONFIG_READ          PSRAM_STS_CONFIG_READ
#define PSRAM_STS_CONFIG_READ_POS      (16U)
#define PSRAM_STS_CONFIG_READ_LEN      (16U)
#define PSRAM_STS_CONFIG_READ_MSK      (((1U << PSRAM_STS_CONFIG_READ_LEN) - 1) << PSRAM_STS_CONFIG_READ_POS)
#define PSRAM_STS_CONFIG_READ_UMSK     (~(((1U << PSRAM_STS_CONFIG_READ_LEN) - 1) << PSRAM_STS_CONFIG_READ_POS))

/* 0x8 : fifo_thres_control */
#define PSRAM_FIFO_THRES_CONTROL_OFFSET (0x8)
#define PSRAM_REG_MASK_W_FIFO_CNT       PSRAM_REG_MASK_W_FIFO_CNT
#define PSRAM_REG_MASK_W_FIFO_CNT_POS   (0U)
#define PSRAM_REG_MASK_W_FIFO_CNT_LEN   (16U)
#define PSRAM_REG_MASK_W_FIFO_CNT_MSK   (((1U << PSRAM_REG_MASK_W_FIFO_CNT_LEN) - 1) << PSRAM_REG_MASK_W_FIFO_CNT_POS)
#define PSRAM_REG_MASK_W_FIFO_CNT_UMSK  (~(((1U << PSRAM_REG_MASK_W_FIFO_CNT_LEN) - 1) << PSRAM_REG_MASK_W_FIFO_CNT_POS))
#define PSRAM_REG_MASK_R_FIFO_REM       PSRAM_REG_MASK_R_FIFO_REM
#define PSRAM_REG_MASK_R_FIFO_REM_POS   (16U)
#define PSRAM_REG_MASK_R_FIFO_REM_LEN   (16U)
#define PSRAM_REG_MASK_R_FIFO_REM_MSK   (((1U << PSRAM_REG_MASK_R_FIFO_REM_LEN) - 1) << PSRAM_REG_MASK_R_FIFO_REM_POS)
#define PSRAM_REG_MASK_R_FIFO_REM_UMSK  (~(((1U << PSRAM_REG_MASK_R_FIFO_REM_LEN) - 1) << PSRAM_REG_MASK_R_FIFO_REM_POS))

/* 0xC : psram_manual_control2 */
#define PSRAM_MANUAL_CONTROL2_OFFSET  (0xC)
#define PSRAM_REG_HOLD_CYCLE_SW       PSRAM_REG_HOLD_CYCLE_SW
#define PSRAM_REG_HOLD_CYCLE_SW_POS   (0U)
#define PSRAM_REG_HOLD_CYCLE_SW_LEN   (7U)
#define PSRAM_REG_HOLD_CYCLE_SW_MSK   (((1U << PSRAM_REG_HOLD_CYCLE_SW_LEN) - 1) << PSRAM_REG_HOLD_CYCLE_SW_POS)
#define PSRAM_REG_HOLD_CYCLE_SW_UMSK  (~(((1U << PSRAM_REG_HOLD_CYCLE_SW_LEN) - 1) << PSRAM_REG_HOLD_CYCLE_SW_POS))
#define PSRAM_REG_HC_SW_EN            PSRAM_REG_HC_SW_EN
#define PSRAM_REG_HC_SW_EN_POS        (7U)
#define PSRAM_REG_HC_SW_EN_LEN        (1U)
#define PSRAM_REG_HC_SW_EN_MSK        (((1U << PSRAM_REG_HC_SW_EN_LEN) - 1) << PSRAM_REG_HC_SW_EN_POS)
#define PSRAM_REG_HC_SW_EN_UMSK       (~(((1U << PSRAM_REG_HC_SW_EN_LEN) - 1) << PSRAM_REG_HC_SW_EN_POS))
#define PSRAM_REG_DQS_REL_VAL         PSRAM_REG_DQS_REL_VAL
#define PSRAM_REG_DQS_REL_VAL_POS     (8U)
#define PSRAM_REG_DQS_REL_VAL_LEN     (7U)
#define PSRAM_REG_DQS_REL_VAL_MSK     (((1U << PSRAM_REG_DQS_REL_VAL_LEN) - 1) << PSRAM_REG_DQS_REL_VAL_POS)
#define PSRAM_REG_DQS_REL_VAL_UMSK    (~(((1U << PSRAM_REG_DQS_REL_VAL_LEN) - 1) << PSRAM_REG_DQS_REL_VAL_POS))
#define PSRAM_REG_PWRAP_SW_SHT_B      PSRAM_REG_PWRAP_SW_SHT_B
#define PSRAM_REG_PWRAP_SW_SHT_B_POS  (16U)
#define PSRAM_REG_PWRAP_SW_SHT_B_LEN  (4U)
#define PSRAM_REG_PWRAP_SW_SHT_B_MSK  (((1U << PSRAM_REG_PWRAP_SW_SHT_B_LEN) - 1) << PSRAM_REG_PWRAP_SW_SHT_B_POS)
#define PSRAM_REG_PWRAP_SW_SHT_B_UMSK (~(((1U << PSRAM_REG_PWRAP_SW_SHT_B_LEN) - 1) << PSRAM_REG_PWRAP_SW_SHT_B_POS))
#define PSRAM_REG_PWRAP_SW_EN         PSRAM_REG_PWRAP_SW_EN
#define PSRAM_REG_PWRAP_SW_EN_POS     (23U)
#define PSRAM_REG_PWRAP_SW_EN_LEN     (1U)
#define PSRAM_REG_PWRAP_SW_EN_MSK     (((1U << PSRAM_REG_PWRAP_SW_EN_LEN) - 1) << PSRAM_REG_PWRAP_SW_EN_POS)
#define PSRAM_REG_PWRAP_SW_EN_UMSK    (~(((1U << PSRAM_REG_PWRAP_SW_EN_LEN) - 1) << PSRAM_REG_PWRAP_SW_EN_POS))
#define PSRAM_REG_ADDR_MASK           PSRAM_REG_ADDR_MASK
#define PSRAM_REG_ADDR_MASK_POS       (24U)
#define PSRAM_REG_ADDR_MASK_LEN       (8U)
#define PSRAM_REG_ADDR_MASK_MSK       (((1U << PSRAM_REG_ADDR_MASK_LEN) - 1) << PSRAM_REG_ADDR_MASK_POS)
#define PSRAM_REG_ADDR_MASK_UMSK      (~(((1U << PSRAM_REG_ADDR_MASK_LEN) - 1) << PSRAM_REG_ADDR_MASK_POS))

/* 0x10 : winbond_psram_configure */
#define PSRAM_WINBOND_PSRAM_CONFIGURE_OFFSET (0x10)
#define PSRAM_REG_WB_LATENCY                 PSRAM_REG_WB_LATENCY
#define PSRAM_REG_WB_LATENCY_POS             (0U)
#define PSRAM_REG_WB_LATENCY_LEN             (4U)
#define PSRAM_REG_WB_LATENCY_MSK             (((1U << PSRAM_REG_WB_LATENCY_LEN) - 1) << PSRAM_REG_WB_LATENCY_POS)
#define PSRAM_REG_WB_LATENCY_UMSK            (~(((1U << PSRAM_REG_WB_LATENCY_LEN) - 1) << PSRAM_REG_WB_LATENCY_POS))
#define PSRAM_REG_WB_DRIVE_ST                PSRAM_REG_WB_DRIVE_ST
#define PSRAM_REG_WB_DRIVE_ST_POS            (4U)
#define PSRAM_REG_WB_DRIVE_ST_LEN            (3U)
#define PSRAM_REG_WB_DRIVE_ST_MSK            (((1U << PSRAM_REG_WB_DRIVE_ST_LEN) - 1) << PSRAM_REG_WB_DRIVE_ST_POS)
#define PSRAM_REG_WB_DRIVE_ST_UMSK           (~(((1U << PSRAM_REG_WB_DRIVE_ST_LEN) - 1) << PSRAM_REG_WB_DRIVE_ST_POS))
#define PSRAM_REG_WB_HYBRID_EN               PSRAM_REG_WB_HYBRID_EN
#define PSRAM_REG_WB_HYBRID_EN_POS           (7U)
#define PSRAM_REG_WB_HYBRID_EN_LEN           (1U)
#define PSRAM_REG_WB_HYBRID_EN_MSK           (((1U << PSRAM_REG_WB_HYBRID_EN_LEN) - 1) << PSRAM_REG_WB_HYBRID_EN_POS)
#define PSRAM_REG_WB_HYBRID_EN_UMSK          (~(((1U << PSRAM_REG_WB_HYBRID_EN_LEN) - 1) << PSRAM_REG_WB_HYBRID_EN_POS))
#define PSRAM_REG_WB_BURST_LENGTH            PSRAM_REG_WB_BURST_LENGTH
#define PSRAM_REG_WB_BURST_LENGTH_POS        (8U)
#define PSRAM_REG_WB_BURST_LENGTH_LEN        (3U)
#define PSRAM_REG_WB_BURST_LENGTH_MSK        (((1U << PSRAM_REG_WB_BURST_LENGTH_LEN) - 1) << PSRAM_REG_WB_BURST_LENGTH_POS)
#define PSRAM_REG_WB_BURST_LENGTH_UMSK       (~(((1U << PSRAM_REG_WB_BURST_LENGTH_LEN) - 1) << PSRAM_REG_WB_BURST_LENGTH_POS))
#define PSRAM_REG_WB_FIX_LATENCY             PSRAM_REG_WB_FIX_LATENCY
#define PSRAM_REG_WB_FIX_LATENCY_POS         (12U)
#define PSRAM_REG_WB_FIX_LATENCY_LEN         (1U)
#define PSRAM_REG_WB_FIX_LATENCY_MSK         (((1U << PSRAM_REG_WB_FIX_LATENCY_LEN) - 1) << PSRAM_REG_WB_FIX_LATENCY_POS)
#define PSRAM_REG_WB_FIX_LATENCY_UMSK        (~(((1U << PSRAM_REG_WB_FIX_LATENCY_LEN) - 1) << PSRAM_REG_WB_FIX_LATENCY_POS))
#define PSRAM_REG_WB_DPD_DIS                 PSRAM_REG_WB_DPD_DIS
#define PSRAM_REG_WB_DPD_DIS_POS             (13U)
#define PSRAM_REG_WB_DPD_DIS_LEN             (1U)
#define PSRAM_REG_WB_DPD_DIS_MSK             (((1U << PSRAM_REG_WB_DPD_DIS_LEN) - 1) << PSRAM_REG_WB_DPD_DIS_POS)
#define PSRAM_REG_WB_DPD_DIS_UMSK            (~(((1U << PSRAM_REG_WB_DPD_DIS_LEN) - 1) << PSRAM_REG_WB_DPD_DIS_POS))
#define PSRAM_REG_WB_PASR                    PSRAM_REG_WB_PASR
#define PSRAM_REG_WB_PASR_POS                (16U)
#define PSRAM_REG_WB_PASR_LEN                (5U)
#define PSRAM_REG_WB_PASR_MSK                (((1U << PSRAM_REG_WB_PASR_LEN) - 1) << PSRAM_REG_WB_PASR_POS)
#define PSRAM_REG_WB_PASR_UMSK               (~(((1U << PSRAM_REG_WB_PASR_LEN) - 1) << PSRAM_REG_WB_PASR_POS))
#define PSRAM_REG_WB_HYBRID_SLP              PSRAM_REG_WB_HYBRID_SLP
#define PSRAM_REG_WB_HYBRID_SLP_POS          (24U)
#define PSRAM_REG_WB_HYBRID_SLP_LEN          (1U)
#define PSRAM_REG_WB_HYBRID_SLP_MSK          (((1U << PSRAM_REG_WB_HYBRID_SLP_LEN) - 1) << PSRAM_REG_WB_HYBRID_SLP_POS)
#define PSRAM_REG_WB_HYBRID_SLP_UMSK         (~(((1U << PSRAM_REG_WB_HYBRID_SLP_LEN) - 1) << PSRAM_REG_WB_HYBRID_SLP_POS))
#define PSRAM_REG_WB_LINEAR_DIS              PSRAM_REG_WB_LINEAR_DIS
#define PSRAM_REG_WB_LINEAR_DIS_POS          (25U)
#define PSRAM_REG_WB_LINEAR_DIS_LEN          (1U)
#define PSRAM_REG_WB_LINEAR_DIS_MSK          (((1U << PSRAM_REG_WB_LINEAR_DIS_LEN) - 1) << PSRAM_REG_WB_LINEAR_DIS_POS)
#define PSRAM_REG_WB_LINEAR_DIS_UMSK         (~(((1U << PSRAM_REG_WB_LINEAR_DIS_LEN) - 1) << PSRAM_REG_WB_LINEAR_DIS_POS))
#define PSRAM_REG_WB_IPD                     PSRAM_REG_WB_IPD
#define PSRAM_REG_WB_IPD_POS                 (29U)
#define PSRAM_REG_WB_IPD_LEN                 (1U)
#define PSRAM_REG_WB_IPD_MSK                 (((1U << PSRAM_REG_WB_IPD_LEN) - 1) << PSRAM_REG_WB_IPD_POS)
#define PSRAM_REG_WB_IPD_UMSK                (~(((1U << PSRAM_REG_WB_IPD_LEN) - 1) << PSRAM_REG_WB_IPD_POS))
#define PSRAM_REG_WB_MCLK_TYPE               PSRAM_REG_WB_MCLK_TYPE
#define PSRAM_REG_WB_MCLK_TYPE_POS           (30U)
#define PSRAM_REG_WB_MCLK_TYPE_LEN           (1U)
#define PSRAM_REG_WB_MCLK_TYPE_MSK           (((1U << PSRAM_REG_WB_MCLK_TYPE_LEN) - 1) << PSRAM_REG_WB_MCLK_TYPE_POS)
#define PSRAM_REG_WB_MCLK_TYPE_UMSK          (~(((1U << PSRAM_REG_WB_MCLK_TYPE_LEN) - 1) << PSRAM_REG_WB_MCLK_TYPE_POS))
#define PSRAM_REG_WB_SW_RST                  PSRAM_REG_WB_SW_RST
#define PSRAM_REG_WB_SW_RST_POS              (31U)
#define PSRAM_REG_WB_SW_RST_LEN              (1U)
#define PSRAM_REG_WB_SW_RST_MSK              (((1U << PSRAM_REG_WB_SW_RST_LEN) - 1) << PSRAM_REG_WB_SW_RST_POS)
#define PSRAM_REG_WB_SW_RST_UMSK             (~(((1U << PSRAM_REG_WB_SW_RST_LEN) - 1) << PSRAM_REG_WB_SW_RST_POS))

/* 0x14 : winbond_psram_status */
#define PSRAM_WINBOND_PSRAM_STATUS_OFFSET (0x14)
#define PSRAM_STS_WB_LATENCY              PSRAM_STS_WB_LATENCY
#define PSRAM_STS_WB_LATENCY_POS          (0U)
#define PSRAM_STS_WB_LATENCY_LEN          (4U)
#define PSRAM_STS_WB_LATENCY_MSK          (((1U << PSRAM_STS_WB_LATENCY_LEN) - 1) << PSRAM_STS_WB_LATENCY_POS)
#define PSRAM_STS_WB_LATENCY_UMSK         (~(((1U << PSRAM_STS_WB_LATENCY_LEN) - 1) << PSRAM_STS_WB_LATENCY_POS))
#define PSRAM_STS_WB_DRIVE_ST             PSRAM_STS_WB_DRIVE_ST
#define PSRAM_STS_WB_DRIVE_ST_POS         (4U)
#define PSRAM_STS_WB_DRIVE_ST_LEN         (3U)
#define PSRAM_STS_WB_DRIVE_ST_MSK         (((1U << PSRAM_STS_WB_DRIVE_ST_LEN) - 1) << PSRAM_STS_WB_DRIVE_ST_POS)
#define PSRAM_STS_WB_DRIVE_ST_UMSK        (~(((1U << PSRAM_STS_WB_DRIVE_ST_LEN) - 1) << PSRAM_STS_WB_DRIVE_ST_POS))
#define PSRAM_STS_WB_HYBRID_EN            PSRAM_STS_WB_HYBRID_EN
#define PSRAM_STS_WB_HYBRID_EN_POS        (7U)
#define PSRAM_STS_WB_HYBRID_EN_LEN        (1U)
#define PSRAM_STS_WB_HYBRID_EN_MSK        (((1U << PSRAM_STS_WB_HYBRID_EN_LEN) - 1) << PSRAM_STS_WB_HYBRID_EN_POS)
#define PSRAM_STS_WB_HYBRID_EN_UMSK       (~(((1U << PSRAM_STS_WB_HYBRID_EN_LEN) - 1) << PSRAM_STS_WB_HYBRID_EN_POS))
#define PSRAM_STS_WB_BURST_LENGTH         PSRAM_STS_WB_BURST_LENGTH
#define PSRAM_STS_WB_BURST_LENGTH_POS     (8U)
#define PSRAM_STS_WB_BURST_LENGTH_LEN     (3U)
#define PSRAM_STS_WB_BURST_LENGTH_MSK     (((1U << PSRAM_STS_WB_BURST_LENGTH_LEN) - 1) << PSRAM_STS_WB_BURST_LENGTH_POS)
#define PSRAM_STS_WB_BURST_LENGTH_UMSK    (~(((1U << PSRAM_STS_WB_BURST_LENGTH_LEN) - 1) << PSRAM_STS_WB_BURST_LENGTH_POS))
#define PSRAM_STS_WB_FIX_LATENCY          PSRAM_STS_WB_FIX_LATENCY
#define PSRAM_STS_WB_FIX_LATENCY_POS      (12U)
#define PSRAM_STS_WB_FIX_LATENCY_LEN      (1U)
#define PSRAM_STS_WB_FIX_LATENCY_MSK      (((1U << PSRAM_STS_WB_FIX_LATENCY_LEN) - 1) << PSRAM_STS_WB_FIX_LATENCY_POS)
#define PSRAM_STS_WB_FIX_LATENCY_UMSK     (~(((1U << PSRAM_STS_WB_FIX_LATENCY_LEN) - 1) << PSRAM_STS_WB_FIX_LATENCY_POS))
#define PSRAM_STS_WB_DPD_DIS              PSRAM_STS_WB_DPD_DIS
#define PSRAM_STS_WB_DPD_DIS_POS          (13U)
#define PSRAM_STS_WB_DPD_DIS_LEN          (1U)
#define PSRAM_STS_WB_DPD_DIS_MSK          (((1U << PSRAM_STS_WB_DPD_DIS_LEN) - 1) << PSRAM_STS_WB_DPD_DIS_POS)
#define PSRAM_STS_WB_DPD_DIS_UMSK         (~(((1U << PSRAM_STS_WB_DPD_DIS_LEN) - 1) << PSRAM_STS_WB_DPD_DIS_POS))
#define PSRAM_STS_WB_PASR                 PSRAM_STS_WB_PASR
#define PSRAM_STS_WB_PASR_POS             (16U)
#define PSRAM_STS_WB_PASR_LEN             (5U)
#define PSRAM_STS_WB_PASR_MSK             (((1U << PSRAM_STS_WB_PASR_LEN) - 1) << PSRAM_STS_WB_PASR_POS)
#define PSRAM_STS_WB_PASR_UMSK            (~(((1U << PSRAM_STS_WB_PASR_LEN) - 1) << PSRAM_STS_WB_PASR_POS))
#define PSRAM_STS_WB_HYBRID_SLP           PSRAM_STS_WB_HYBRID_SLP
#define PSRAM_STS_WB_HYBRID_SLP_POS       (24U)
#define PSRAM_STS_WB_HYBRID_SLP_LEN       (1U)
#define PSRAM_STS_WB_HYBRID_SLP_MSK       (((1U << PSRAM_STS_WB_HYBRID_SLP_LEN) - 1) << PSRAM_STS_WB_HYBRID_SLP_POS)
#define PSRAM_STS_WB_HYBRID_SLP_UMSK      (~(((1U << PSRAM_STS_WB_HYBRID_SLP_LEN) - 1) << PSRAM_STS_WB_HYBRID_SLP_POS))
#define PSRAM_STS_WB_MCLK_TYPE            PSRAM_STS_WB_MCLK_TYPE
#define PSRAM_STS_WB_MCLK_TYPE_POS        (30U)
#define PSRAM_STS_WB_MCLK_TYPE_LEN        (1U)
#define PSRAM_STS_WB_MCLK_TYPE_MSK        (((1U << PSRAM_STS_WB_MCLK_TYPE_LEN) - 1) << PSRAM_STS_WB_MCLK_TYPE_POS)
#define PSRAM_STS_WB_MCLK_TYPE_UMSK       (~(((1U << PSRAM_STS_WB_MCLK_TYPE_LEN) - 1) << PSRAM_STS_WB_MCLK_TYPE_POS))

/* 0x18 : winbond_psram_configure2 */
#define PSRAM_WINBOND_PSRAM_CONFIGURE2_OFFSET (0x18)
#define PSRAM_REG_WB_ZQ_CODE                  PSRAM_REG_WB_ZQ_CODE
#define PSRAM_REG_WB_ZQ_CODE_POS              (0U)
#define PSRAM_REG_WB_ZQ_CODE_LEN              (4U)
#define PSRAM_REG_WB_ZQ_CODE_MSK              (((1U << PSRAM_REG_WB_ZQ_CODE_LEN) - 1) << PSRAM_REG_WB_ZQ_CODE_POS)
#define PSRAM_REG_WB_ZQ_CODE_UMSK             (~(((1U << PSRAM_REG_WB_ZQ_CODE_LEN) - 1) << PSRAM_REG_WB_ZQ_CODE_POS))

/* 0x20 : apmemory_psram_configure */
#define PSRAM_APMEMORY_PSRAM_CONFIGURE_OFFSET (0x20)
#define PSRAM_REG_AP_BURST_LENGTH             PSRAM_REG_AP_BURST_LENGTH
#define PSRAM_REG_AP_BURST_LENGTH_POS         (0U)
#define PSRAM_REG_AP_BURST_LENGTH_LEN         (2U)
#define PSRAM_REG_AP_BURST_LENGTH_MSK         (((1U << PSRAM_REG_AP_BURST_LENGTH_LEN) - 1) << PSRAM_REG_AP_BURST_LENGTH_POS)
#define PSRAM_REG_AP_BURST_LENGTH_UMSK        (~(((1U << PSRAM_REG_AP_BURST_LENGTH_LEN) - 1) << PSRAM_REG_AP_BURST_LENGTH_POS))
#define PSRAM_REG_AP_BURST_TYPE               PSRAM_REG_AP_BURST_TYPE
#define PSRAM_REG_AP_BURST_TYPE_POS           (4U)
#define PSRAM_REG_AP_BURST_TYPE_LEN           (1U)
#define PSRAM_REG_AP_BURST_TYPE_MSK           (((1U << PSRAM_REG_AP_BURST_TYPE_LEN) - 1) << PSRAM_REG_AP_BURST_TYPE_POS)
#define PSRAM_REG_AP_BURST_TYPE_UMSK          (~(((1U << PSRAM_REG_AP_BURST_TYPE_LEN) - 1) << PSRAM_REG_AP_BURST_TYPE_POS))
#define PSRAM_REG_AP_RBX                      PSRAM_REG_AP_RBX
#define PSRAM_REG_AP_RBX_POS                  (5U)
#define PSRAM_REG_AP_RBX_LEN                  (1U)
#define PSRAM_REG_AP_RBX_MSK                  (((1U << PSRAM_REG_AP_RBX_LEN) - 1) << PSRAM_REG_AP_RBX_POS)
#define PSRAM_REG_AP_RBX_UMSK                 (~(((1U << PSRAM_REG_AP_RBX_LEN) - 1) << PSRAM_REG_AP_RBX_POS))
#define PSRAM_REG_AP_DPD                      PSRAM_REG_AP_DPD
#define PSRAM_REG_AP_DPD_POS                  (6U)
#define PSRAM_REG_AP_DPD_LEN                  (1U)
#define PSRAM_REG_AP_DPD_MSK                  (((1U << PSRAM_REG_AP_DPD_LEN) - 1) << PSRAM_REG_AP_DPD_POS)
#define PSRAM_REG_AP_DPD_UMSK                 (~(((1U << PSRAM_REG_AP_DPD_LEN) - 1) << PSRAM_REG_AP_DPD_POS))
#define PSRAM_REG_AP_SLEEP                    PSRAM_REG_AP_SLEEP
#define PSRAM_REG_AP_SLEEP_POS                (7U)
#define PSRAM_REG_AP_SLEEP_LEN                (1U)
#define PSRAM_REG_AP_SLEEP_MSK                (((1U << PSRAM_REG_AP_SLEEP_LEN) - 1) << PSRAM_REG_AP_SLEEP_POS)
#define PSRAM_REG_AP_SLEEP_UMSK               (~(((1U << PSRAM_REG_AP_SLEEP_LEN) - 1) << PSRAM_REG_AP_SLEEP_POS))
#define PSRAM_REG_AP_PASR                     PSRAM_REG_AP_PASR
#define PSRAM_REG_AP_PASR_POS                 (8U)
#define PSRAM_REG_AP_PASR_LEN                 (3U)
#define PSRAM_REG_AP_PASR_MSK                 (((1U << PSRAM_REG_AP_PASR_LEN) - 1) << PSRAM_REG_AP_PASR_POS)
#define PSRAM_REG_AP_PASR_UMSK                (~(((1U << PSRAM_REG_AP_PASR_LEN) - 1) << PSRAM_REG_AP_PASR_POS))
#define PSRAM_REG_AP_W_LATENCY_CODE           PSRAM_REG_AP_W_LATENCY_CODE
#define PSRAM_REG_AP_W_LATENCY_CODE_POS       (12U)
#define PSRAM_REG_AP_W_LATENCY_CODE_LEN       (3U)
#define PSRAM_REG_AP_W_LATENCY_CODE_MSK       (((1U << PSRAM_REG_AP_W_LATENCY_CODE_LEN) - 1) << PSRAM_REG_AP_W_LATENCY_CODE_POS)
#define PSRAM_REG_AP_W_LATENCY_CODE_UMSK      (~(((1U << PSRAM_REG_AP_W_LATENCY_CODE_LEN) - 1) << PSRAM_REG_AP_W_LATENCY_CODE_POS))
#define PSRAM_REG_AP_DRIVE_ST                 PSRAM_REG_AP_DRIVE_ST
#define PSRAM_REG_AP_DRIVE_ST_POS             (16U)
#define PSRAM_REG_AP_DRIVE_ST_LEN             (2U)
#define PSRAM_REG_AP_DRIVE_ST_MSK             (((1U << PSRAM_REG_AP_DRIVE_ST_LEN) - 1) << PSRAM_REG_AP_DRIVE_ST_POS)
#define PSRAM_REG_AP_DRIVE_ST_UMSK            (~(((1U << PSRAM_REG_AP_DRIVE_ST_LEN) - 1) << PSRAM_REG_AP_DRIVE_ST_POS))
#define PSRAM_REG_AP_RF                       PSRAM_REG_AP_RF
#define PSRAM_REG_AP_RF_POS                   (18U)
#define PSRAM_REG_AP_RF_LEN                   (2U)
#define PSRAM_REG_AP_RF_MSK                   (((1U << PSRAM_REG_AP_RF_LEN) - 1) << PSRAM_REG_AP_RF_POS)
#define PSRAM_REG_AP_RF_UMSK                  (~(((1U << PSRAM_REG_AP_RF_LEN) - 1) << PSRAM_REG_AP_RF_POS))
#define PSRAM_REG_AP_R_LATENCY_CODE           PSRAM_REG_AP_R_LATENCY_CODE
#define PSRAM_REG_AP_R_LATENCY_CODE_POS       (20U)
#define PSRAM_REG_AP_R_LATENCY_CODE_LEN       (3U)
#define PSRAM_REG_AP_R_LATENCY_CODE_MSK       (((1U << PSRAM_REG_AP_R_LATENCY_CODE_LEN) - 1) << PSRAM_REG_AP_R_LATENCY_CODE_POS)
#define PSRAM_REG_AP_R_LATENCY_CODE_UMSK      (~(((1U << PSRAM_REG_AP_R_LATENCY_CODE_LEN) - 1) << PSRAM_REG_AP_R_LATENCY_CODE_POS))
#define PSRAM_REG_AP_R_LATENCY_TYPE           PSRAM_REG_AP_R_LATENCY_TYPE
#define PSRAM_REG_AP_R_LATENCY_TYPE_POS       (24U)
#define PSRAM_REG_AP_R_LATENCY_TYPE_LEN       (1U)
#define PSRAM_REG_AP_R_LATENCY_TYPE_MSK       (((1U << PSRAM_REG_AP_R_LATENCY_TYPE_LEN) - 1) << PSRAM_REG_AP_R_LATENCY_TYPE_POS)
#define PSRAM_REG_AP_R_LATENCY_TYPE_UMSK      (~(((1U << PSRAM_REG_AP_R_LATENCY_TYPE_LEN) - 1) << PSRAM_REG_AP_R_LATENCY_TYPE_POS))
#define PSRAM_REG_AP_LINEAR_DIS               PSRAM_REG_AP_LINEAR_DIS
#define PSRAM_REG_AP_LINEAR_DIS_POS           (25U)
#define PSRAM_REG_AP_LINEAR_DIS_LEN           (1U)
#define PSRAM_REG_AP_LINEAR_DIS_MSK           (((1U << PSRAM_REG_AP_LINEAR_DIS_LEN) - 1) << PSRAM_REG_AP_LINEAR_DIS_POS)
#define PSRAM_REG_AP_LINEAR_DIS_UMSK          (~(((1U << PSRAM_REG_AP_LINEAR_DIS_LEN) - 1) << PSRAM_REG_AP_LINEAR_DIS_POS))
#define PSRAM_REG_GLB_RESET_PULSE             PSRAM_REG_GLB_RESET_PULSE
#define PSRAM_REG_GLB_RESET_PULSE_POS         (28U)
#define PSRAM_REG_GLB_RESET_PULSE_LEN         (1U)
#define PSRAM_REG_GLB_RESET_PULSE_MSK         (((1U << PSRAM_REG_GLB_RESET_PULSE_LEN) - 1) << PSRAM_REG_GLB_RESET_PULSE_POS)
#define PSRAM_REG_GLB_RESET_PULSE_UMSK        (~(((1U << PSRAM_REG_GLB_RESET_PULSE_LEN) - 1) << PSRAM_REG_GLB_RESET_PULSE_POS))

