RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/psram_reg.h
/* 0x110 : psram_rough_delay_ctrl4 */
#define PSRAM_ROUGH_DELAY_CTRL4_OFFSET  (0x110)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5      PSRAM_REG_ROUGH_SEL_I_ADQ5
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ5_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ5_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ5_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ5_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ4      PSRAM_REG_ROUGH_SEL_I_ADQ4
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ4_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ4_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ4_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ4_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ3      PSRAM_REG_ROUGH_SEL_I_ADQ3
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ3_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ3_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ3_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ3_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ2      PSRAM_REG_ROUGH_SEL_I_ADQ2
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ2_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ2_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ2_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ2_POS))

/* 0x114 : psram_rough_delay_ctrl5 */
#define PSRAM_ROUGH_DELAY_CTRL5_OFFSET  (0x114)
#define PSRAM_REG_ROUGH_SEL_I_DQS0      PSRAM_REG_ROUGH_SEL_I_DQS0
#define PSRAM_REG_ROUGH_SEL_I_DQS0_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_LEN  (16U)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS0_POS)
#define PSRAM_REG_ROUGH_SEL_I_DQS0_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_DQS0_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS0_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ7      PSRAM_REG_ROUGH_SEL_I_ADQ7
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ7_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ7_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ7_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ7_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ6      PSRAM_REG_ROUGH_SEL_I_ADQ6
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ6_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ6_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ6_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ6_POS))

/* 0x118 : psram_rough_delay_ctrl6 */
#define PSRAM_ROUGH_DELAY_CTRL6_OFFSET      (0x118)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9          PSRAM_REG_ROUGH_SEL_O_ADQ9
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_POS      (0U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ9_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ9_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ9_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ8          PSRAM_REG_ROUGH_SEL_O_ADQ8
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_POS      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ8_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ8_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ8_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1      PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ_OEN1_POS))
#define PSRAM_REG_ROUGH_SEL_O_DQS1          PSRAM_REG_ROUGH_SEL_O_DQS1
#define PSRAM_REG_ROUGH_SEL_O_DQS1_POS      (24U)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_LEN      (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_MSK      (((1U << PSRAM_REG_ROUGH_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS1_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS1_UMSK     (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS1_POS))

/* 0x11C : psram_rough_delay_ctrl7 */
#define PSRAM_ROUGH_DELAY_CTRL7_OFFSET   (0x11C)
#define PSRAM_REG_ROUGH_SEL_O_ADQ13      PSRAM_REG_ROUGH_SEL_O_ADQ13
#define PSRAM_REG_ROUGH_SEL_O_ADQ13_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ13_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ13_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ13_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ13_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ13_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ13_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ13_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ12      PSRAM_REG_ROUGH_SEL_O_ADQ12
#define PSRAM_REG_ROUGH_SEL_O_ADQ12_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ12_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ12_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ12_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ12_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ12_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ12_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ12_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ11      PSRAM_REG_ROUGH_SEL_O_ADQ11
#define PSRAM_REG_ROUGH_SEL_O_ADQ11_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ11_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ11_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ11_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ11_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ11_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ11_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ11_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ10      PSRAM_REG_ROUGH_SEL_O_ADQ10
#define PSRAM_REG_ROUGH_SEL_O_ADQ10_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ10_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ10_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ10_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ10_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ10_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ10_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ10_POS))

/* 0x120 : psram_rough_delay_ctrl8 */
#define PSRAM_ROUGH_DELAY_CTRL8_OFFSET   (0x120)
#define PSRAM_REG_ROUGH_SEL_I_ADQ9       PSRAM_REG_ROUGH_SEL_I_ADQ9
#define PSRAM_REG_ROUGH_SEL_I_ADQ9_POS   (0U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ9_LEN   (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ9_MSK   (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ9_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ9_UMSK  (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ9_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ9_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ8       PSRAM_REG_ROUGH_SEL_I_ADQ8
#define PSRAM_REG_ROUGH_SEL_I_ADQ8_POS   (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ8_LEN   (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ8_MSK   (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ8_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ8_UMSK  (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ8_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ8_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ15      PSRAM_REG_ROUGH_SEL_O_ADQ15
#define PSRAM_REG_ROUGH_SEL_O_ADQ15_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ15_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ15_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ15_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ15_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ15_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ15_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ15_POS))
#define PSRAM_REG_ROUGH_SEL_O_ADQ14      PSRAM_REG_ROUGH_SEL_O_ADQ14
#define PSRAM_REG_ROUGH_SEL_O_ADQ14_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ14_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_ADQ14_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_ADQ14_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ14_POS)
#define PSRAM_REG_ROUGH_SEL_O_ADQ14_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_ADQ14_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_ADQ14_POS))

/* 0x124 : psram_rough_delay_ctrl9 */
#define PSRAM_ROUGH_DELAY_CTRL9_OFFSET   (0x124)
#define PSRAM_REG_ROUGH_SEL_I_ADQ13      PSRAM_REG_ROUGH_SEL_I_ADQ13
#define PSRAM_REG_ROUGH_SEL_I_ADQ13_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ13_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ13_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ13_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ13_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ13_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ13_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ13_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ12      PSRAM_REG_ROUGH_SEL_I_ADQ12
#define PSRAM_REG_ROUGH_SEL_I_ADQ12_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ12_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ12_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ12_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ12_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ12_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ12_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ12_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ11      PSRAM_REG_ROUGH_SEL_I_ADQ11
#define PSRAM_REG_ROUGH_SEL_I_ADQ11_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ11_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ11_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ11_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ11_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ11_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ11_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ11_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ10      PSRAM_REG_ROUGH_SEL_I_ADQ10
#define PSRAM_REG_ROUGH_SEL_I_ADQ10_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ10_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ10_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ10_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ10_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ10_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ10_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ10_POS))

/* 0x128 : psram_rough_delay_ctrlA */
#define PSRAM_ROUGH_DELAY_CTRLA_OFFSET   (0x128)
#define PSRAM_REG_ROUGH_SEL_I_DQS1       PSRAM_REG_ROUGH_SEL_I_DQS1
#define PSRAM_REG_ROUGH_SEL_I_DQS1_POS   (0U)
#define PSRAM_REG_ROUGH_SEL_I_DQS1_LEN   (16U)
#define PSRAM_REG_ROUGH_SEL_I_DQS1_MSK   (((1U << PSRAM_REG_ROUGH_SEL_I_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS1_POS)
#define PSRAM_REG_ROUGH_SEL_I_DQS1_UMSK  (~(((1U << PSRAM_REG_ROUGH_SEL_I_DQS1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_DQS1_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ15      PSRAM_REG_ROUGH_SEL_I_ADQ15
#define PSRAM_REG_ROUGH_SEL_I_ADQ15_POS  (16U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ15_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ15_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ15_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ15_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ15_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ15_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ15_POS))
#define PSRAM_REG_ROUGH_SEL_I_ADQ14      PSRAM_REG_ROUGH_SEL_I_ADQ14
#define PSRAM_REG_ROUGH_SEL_I_ADQ14_POS  (24U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ14_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_I_ADQ14_MSK  (((1U << PSRAM_REG_ROUGH_SEL_I_ADQ14_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ14_POS)
#define PSRAM_REG_ROUGH_SEL_I_ADQ14_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_I_ADQ14_LEN) - 1) << PSRAM_REG_ROUGH_SEL_I_ADQ14_POS))

/* 0x12C : psram_rough_delay_ctrlB */
#define PSRAM_ROUGH_DELAY_CTRLB_OFFSET      (0x12C)
#define PSRAM_REG_ROUGH_SEL_O_DQS_MASK      PSRAM_REG_ROUGH_SEL_O_DQS_MASK
#define PSRAM_REG_ROUGH_SEL_O_DQS_MASK_POS  (0U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_MASK_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_MASK_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_DQS_MASK_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_MASK_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS_MASK_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS_MASK_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_MASK_POS))
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN1      PSRAM_REG_ROUGH_SEL_O_DQS_OEN1
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_POS  (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_LEN  (8U)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_MSK  (((1U << PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_POS)
#define PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_UMSK (~(((1U << PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_LEN) - 1) << PSRAM_REG_ROUGH_SEL_O_DQS_OEN1_POS))

struct psram_reg {
    /* 0x0 : psram_configure */
    union {
        struct
        {
            uint32_t reg_vendor_sel     : 3; /* [ 2: 0],        r/w,        0x2 */
            uint32_t reserved_3         : 1; /* [    3],       rsvd,        0x0 */
            uint32_t reg_ap_mr          : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7         : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_wb_reg_sel     : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11        : 1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_config_w_pusle : 1; /* [   12],        w1p,        0x0 */
            uint32_t reg_config_r_pusle : 1; /* [   13],        w1p,        0x0 */
            uint32_t sts_config_w_done  : 1; /* [   14],          r,        0x1 */
            uint32_t sts_config_r_done  : 1; /* [   15],          r,        0x1 */
            uint32_t reg_config_req     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reg_config_gnt     : 1; /* [   17],          r,        0x0 */
            uint32_t reg_x16_mode       : 1; /* [   18],        r/w,        0x0 */
            uint32_t reg_wb_hyper3      : 1; /* [   19],        r/w,        0x0 */
            uint32_t reg_pck_s_div      : 3; /* [22:20],        r/w,        0x0 */
            uint32_t reg_clkn_free      : 1; /* [   23],        r/w,        0x1 */
            uint32_t reserved_24_27     : 4; /* [27:24],       rsvd,        0x0 */
            uint32_t reg_linear_bnd_b   : 4; /* [31:28],        r/w,        0xa */
        } BF;
        uint32_t WORD;
    } psram_configure;

